Revit 2027 API
ChangeType.IsIdentical Method
 Compares if two ChangeTypes are identical
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsIdentical(
	ChangeType changeType
)
Public Function IsIdentical (
	changeType As ChangeType
) As Boolean
public:
bool IsIdentical(
	ChangeType^ changeType
)
member IsIdentical :
        changeType : ChangeType -> bool
Parameters
changeType ChangeType
 Input ChangeType to be compared
Return Value
Boolean
 True if the this ChangeType and input ChangeType are identical
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ChangeType Class
Autodesk.Revit.DB Namespace